# Users

In [2]:
import pandas as pd

In [3]:
# need both tags and ratings to get a comprehensive set of users. Some users may have rated and not tagged, or vice versa
# I already loaded the users from tags, so I only need the users from ratings that are NOT present in tags

df1 = pd.read_csv('raw_data/tags.csv')
df2 = pd.read_csv('raw_data/ratings.csv')

In [4]:
df1

         userId  movieId                  tag   timestamp
0            10      260         good vs evil  1430666558
1            10      260        Harrison Ford  1430666505
2            10      260               sci-fi  1430666538
3            14     1221            Al Pacino  1311600756
4            14     1221                mafia  1311600746
...         ...      ...                  ...         ...
2328310  330923   176599  politically correct  1507547491
2328311  330933     3317        coming of age  1351279384
2328312  330933     3317            sexuality  1351279389
2328313  330947     5782       Not Luc Besson  1154110902
2328314  330947    44191           comic book  1154271525

[2328315 rows x 4 columns]

In [5]:
df2

          userId  movieId  rating   timestamp
0              1        1     4.0  1225734739
1              1      110     4.0  1225865086
2              1      158     4.0  1225733503
3              1      260     4.5  1225735204
4              1      356     5.0  1225735119
...          ...      ...     ...         ...
33832157  330975     8340     2.0  1091583256
33832158  330975     8493     2.5  1091585709
33832159  330975     8622     4.0  1091581777
33832160  330975     8665     3.0  1091581765
33832161  330975     8783     2.5  1091581799

[33832162 rows x 4 columns]

In [6]:
userIds1 = df1['userId'].unique()
userIds2 = df2['userId'].unique()

In [7]:
df_users1 = pd.DataFrame({'id': userIds1})
df_users2 = pd.DataFrame({'id': userIds2})

In [8]:
df_users1

           id
0          10
1          14
2          16
3          26
4          37
...       ...
25275  330911
25276  330914
25277  330923
25278  330933
25279  330947

[25280 rows x 1 columns]

In [9]:
df_users2

            id
0            1
1            2
2            3
3            4
4            5
...        ...
330970  330971
330971  330972
330972  330973
330973  330974
330974  330975

[330975 rows x 1 columns]

In [10]:
# Find values in df2 that are not in df1
result_df = df_users2[~df_users2['id'].isin(df_users1['id'])]

In [11]:
result_df

            id
0            1
1            2
2            3
3            4
4            5
...        ...
330970  330971
330971  330972
330972  330973
330973  330974
330974  330975

[305695 rows x 1 columns]

In [13]:
result_df.to_csv('DB_models/DB_user2.csv', index=False)